app/controllers/users_controller.rb

INSERT INTO "users" ("attachment_file_name", "created_at", "attachment_content_type", "attachment_file_size", "updated_at", "username", "email", "attachment_updated_at") VALUES('backgrounds.xml', '2010-11-07 17:20:12', 'text/xml', 5323, '2010-11-07 17:20:12', '', '', '2010-11-07 17:20:12')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save